#### Import Libraries

In [2]:
import numpy as np
import pandas as pd

#### Ex.1.1 Create a DataFrame the same to the following tableï¼š
| |   name     | age | birth year | gender |
|-|:----------:|:---:|:----------:|:------:|
|0| Emma       |  21 |    1997    | Female |
|1| Tommy      |  26 |    1992    |  Male  |
|2| Mike       |  23 |    1995    |  Male  |
|3| Steven     |  23 |    1990    |  Male  |
|4| Emily      |  25 |    1993    | Female |
|5| Gloria     |  26 |    1995    | Female |

In [17]:
# code for Ex.1.1
dictionary = {
                  'name'       : pandas.Series(['Emma', 'Tommy', 'Mike', 'Steven', 'Emily', 'Gloria']),
                  'age'        : pandas.Series([21, 26, 23, 23, 25, 26]), 
                  'birth year' : pandas.Series([1997, 1992, 1995, 1990, 1993, 1995]),
                  'gender'     : pandas.Series(['Female', 'Male', 'Male', 'Male', 'Female', 'Female'])
             }
df = pd.DataFrame(dictionary)

# rearrange the order of columns (default order of columns follows the order of alphabet)
cols = df.columns.tolist()
cols = cols[-1:] + cols[:-1]
df = df[cols]

df

   gender    name  age  birth year
0  Female    Emma   21        1997
1    Male   Tommy   26        1992
2    Male    Mike   23        1995
3    Male  Steven   23        1990
4  Female   Emily   25        1993
5  Female  Gloria   26        1995

#### Ex.1.2 Select the last 4 rows of the DataFrame, name it as `subDF` and show its columns and shape

In [18]:
# code for Ex.1.2
subDF = df.tail(4)

print ('columns : ', subDF.columns)
print ('shape   : ', subDF.shape)

columns :  Index(['gender', 'name', 'age', 'birth year'], dtype='object')
shape   :  (4, 4)

#### Ex.1.3 Select the `age` and `gender` columns of 1 to 4 students by using `iloc[]` and `loc[]`

In [19]:
# code for Ex.1.3

# iloc[]
df.iloc[1:5,[1, 3]]

# loc[]
df.loc[1:4,['age', 'gender']]

   age  gender
1   26    Male
2   23    Male
3   23    Male
4   25  Female

#### Ex.1.4 Filter out the students whose age is less than 22 by using Boolean Mask

In [20]:
# code for Ex.1.4
# df[df.loc[:,'age'] >= 22]
df[df['age'] >= 22]

   gender    name  age  birth year
1    Male   Tommy   26        1992
2    Male    Mike   23        1995
3    Male  Steven   23        1990
4  Female   Emily   25        1993
5  Female  Gloria   26        1995

#### Ex.1.5 Filter out the students whose age information is wrong by using Boolean Mask ( `age + year`  should equal to 2018 )

In [21]:
# code for Ex.1.5
df[df['age'] + df['birth year'] == 2018]

   gender   name  age  birth year
0  Female   Emma   21        1997
1    Male  Tommy   26        1992
2    Male   Mike   23        1995
4  Female  Emily   25        1993

#### Ex.1.6 Sort the DataFrame `subDF` by `birth year` in accending order

In [22]:
# code for Ex.1.6
subDF.sort_values(by='birth year', ascending=True)

   gender    name  age  birth year
3    Male  Steven   23        1990
4  Female   Emily   25        1993
2    Male    Mike   23        1995
5  Female  Gloria   26        1995

#### Ex.1.7 Replace the wrong age information with correct ones by using `loc[]`  and Boolean Mask

In [41]:
# code for Ex.1.7
df_wrongAge = df[ df['age'] + df['birth year'] != 2018 ]
df_wrongAge.loc[:,'age'] = 2018 - df_wrongAge.loc[:,'birth year']

df_wrongAge

C:\Users\Prasanth\Anaconda3\envs\deeplearning\lib\site-packages\pandas\core\indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

   gender    name  age  birth year
3    Male  Steven   28        1990
5  Female  Gloria   23        1995

In [47]:
df_correct = df.copy()
df_correct.loc[df['age'] + df['birth year'] != 2018,'age']=df_wrongAge['age']
df_correct

   gender    name  age  birth year
0  Female    Emma   21        1997
1    Male   Tommy   26        1992
2    Male    Mike   23        1995
3    Male  Steven   28        1990
4  Female   Emily   25        1993
5  Female  Gloria   23        1995

In [45]:
df_wrongAge

   gender    name  age  birth year
3    Male  Steven   28        1990
5  Female  Gloria   23        1995